Тест_ЗУП_31_КОРП/src/DataProcessors/МедицинскоеСтрахование/МедицинскоеСтрахование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МедицинскоеСтрахование</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСтрахования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСтрахования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрикреплениеСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПрикрепления</name>
      <type>
        <types>DocumentRef.ПрикреплениеКПрограммамМедицинскогоСтрахования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрикреплениеКПрограммеСтрахованияОтложено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОткреплениеСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОткрепления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОткрепления</name>
      <type>
        <types>DocumentRef.ОткреплениеОтПрограммМедицинскогоСтрахования</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОткреплениеОтПрограммыСтрахованияОтложено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ОтложенноеМедицинскоеСтрахованиеСотрудников/ОтложенноеМедицинскоеСтрахованиеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтложенноеМедицинскоеСтрахованиеСотрудников</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/ПрограммыМедицинскогоСтрахованияСотрудников/ПрограммыМедицинскогоСтрахованияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПрограммыМедицинскогоСтрахованияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрограммаСтрахования</name>
    <type>
      <types>CatalogRef.ПрограммыМедицинскогоСтрахования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родственник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/РасширенияПрограммМедицинскогоСтрахованияСотрудников/РасширенияПрограммМедицинскогоСтрахованияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасширенияПрограммМедицинскогоСтрахованияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховаяПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасширениеПрограммСтрахования</name>
    <type>
      <types>CatalogRef.РасширенияПрограммМедицинскогоСтрахования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родственник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияСотрудника/СостоянияСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСотрудника</name>
  <enumValues>
    <name>Работа</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>РаботаВОтпускеПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Прогул</name>
  </enumValues>
  <enumValues>
    <name>ВынужденныйПрогул</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботника</name>
  </enumValues>
  <enumValues>
    <name>ПростойПоВинеРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ПростойНеЗависящийОтРаботодателяИРаботника</name>
  </enumValues>
  <enumValues>
    <name>ОтпускОсновной</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпуск</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныйОтпускНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйОплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускУчебныйНеоплачиваемый</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоРазрешениюРаботодателя</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНеоплачиваемыйПоЗаконодательству</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоУходуЗаРебенком</name>
  </enumValues>
  <enumValues>
    <name>Командировка</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеССохранениемОплаты</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеГосударственныхОбязанностей</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПоНевыясненнымПричинам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускПоБеременностиИРодам</name>
  </enumValues>
  <enumValues>
    <name>ОтпускНаСанаторноКурортноеЛечение</name>
  </enumValues>
  <enumValues>
    <name>Болезнь</name>
  </enumValues>
  <enumValues>
    <name>БолезньБезОплаты</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ОткреплениеОтПрограммМедицинскогоСтрахования/ОткреплениеОтПрограммМедицинскогоСтрахования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОткреплениеОтПрограммМедицинскогоСтрахования</name>
  <registerRecords>InformationRegister.РасширенияПрограммМедицинскогоСтрахованияСотрудников</registerRecords>
  <registerRecords>InformationRegister.ПрограммыМедицинскогоСтрахованияСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСтрахования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСтрахования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРождения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПрограммыСтрахования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширенияПрограммСтрахования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОткрепления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтраховаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрограммыСтрахованияСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрограммаСтрахования</name>
      <type>
        <types>CatalogRef.ПрограммыМедицинскогоСтрахования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраховаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасширенияПрограммСтрахованияСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РасширениеСтрахования</name>
      <type>
        <types>CatalogRef.РасширенияПрограммМедицинскогоСтрахования</types>
      </type>
    </attributes>
    <attributes>
      <name>СтраховаяПремия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/DataProcessors/МедицинскоеСтрахование/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияДляЗаполнения = Новый Структура;
	ЗначенияДляЗаполнения.Вставить("Организация",	"Объект.Организация");
	ЗначенияДляЗаполнения.Вставить("Подразделение",	"Объект.Подразделение");
	ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
	
	УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников);
	
	СтандартнаяОбработка = Истина;
	ЗарплатаКадрыПереопределяемый.ЗаполнитьРеквизитОрганизацияПриОднофирменномУчете(ЭтотОбъект, СтандартнаяОбработка, "Организация");
	
	Если СтандартнаяОбработка Тогда 
		Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизацийЗарплатаКадрыБазовая") 
			И Не ЗначениеЗаполнено(Объект.Организация) Тогда 
			Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ПрикреплениеКПрограммамМедицинскогоСтрахования" Тогда
		ПрикреплениеКПрограммамСтрахованияЗаполнить();
	ИначеЕсли ИмяСобытия = "Запись_ОткреплениеОтПрограммМедицинскогоСтрахования" Тогда
		ОткреплениеОтПрограммСтрахованияЗаполнить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраховаяКомпанияПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСотрудниковНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("ТекущаяСтрока", ГруппаСотрудников);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("УсловияСтрахованияСотрудниковЗакрытие", ЭтотОбъект);
	ОткрытьФорму("Справочник.ГруппыСотрудников.ФормаСписка", ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСотрудниковПриИзменении(Элемент)
	ПриИзмененииОсновныхПолейНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УсловияСтрахованияСотрудниковПриИзменении(Элемент)
	
	Если УсловияСтрахованияСотрудников = 0 Тогда
		ГруппаСотрудников = Неопределено;
		ПриИзмененииОсновныхПолейНаСервере();
	КонецЕсли;
	
	УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыПрикреплениеСотрудников

&НаКлиенте
Процедура ПрикреплениеСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ПрикреплениеСотрудниковКоманда" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Команда = "Отложить" Тогда
			ТекущиеДанные.ПрикреплениеКПрограммеСтрахованияОтложено = Истина;
			ОтложитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Возобновить'");
		Иначе
			ТекущиеДанные.ПрикреплениеКПрограммеСтрахованияОтложено = Ложь;
			ВозобновитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Отложить'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыОткреплениеСотрудников

&НаКлиенте
Процедура ОткреплениеСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ОткреплениеСотрудниковКоманда" Тогда
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Если ТекущиеДанные.Команда = "Отложить" Тогда
			ТекущиеДанные.ОткреплениеОтПрограммыСтрахованияОтложено = Истина;
			ОтложитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Возобновить'");
		Иначе
			ТекущиеДанные.ОткреплениеОтПрограммыСтрахованияОтложено = Ложь;
			ВозобновитьСотрудника(ТекущиеДанные.Сотрудник);
			ТекущиеДанные.Команда = НСтр("ru = 'Отложить'");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей(Команда)
	
	Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка = Не Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	ПоказыватьОтложенныхСтрахователей = Элементы.ПрикреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	УстановитьОтборСтрок(Элементы, "ПрикреплениеСотрудников", "ПрикреплениеКПрограммеСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплениеСотрудниковОбновить(Команда)
	ПрикреплениеКПрограммамСтрахованияЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияСсылка", Объект.Организация);
	ПараметрыОткрытия.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("НастройкиПоУмолчаниюЗакрытие", ЭтотОбъект);
	ОткрытьФорму(МедицинскоеСтрахованиеКлиент.ИмяФормыНастройкиМедицинскогоСтрахования(),
		ПараметрыОткрытия, ЭтотОбъект,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикреплениеСформировать(Команда)
	
	Отказ = ПроверитьНаКлиенте();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("ПрикреплениеКПрограммеСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ПрикреплениеСотрудников.НайтиСтроки(ПараметрыОтбораСтрок);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивСотрудников.Добавить(НайденнаяСтрока.Сотрудник);
	КонецЦикла;
	
	ОткрытьПрикреплениеСотрудников(, МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСформировать(Команда)
	
	Отказ = ПроверитьНаКлиенте();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Новый Массив;
	
	ПараметрыОтбораСтрок = Новый Структура;
	ПараметрыОтбораСтрок.Вставить("ОткреплениеОтПрограммыСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ОткреплениеСотрудников.НайтиСтроки(ПараметрыОтбораСтрок);
	Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		МассивСотрудников.Добавить(НайденнаяСтрока.Сотрудник);
	КонецЦикла;
	
	ОткрытьОткреплениеСотрудников(, МассивСотрудников);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСтрокуПрикрепления(Команда)
	
	ТекущиеДанные = Элементы.ПрикреплениеСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьПрикреплениеСотрудников(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСотрудниковОбновить(Команда)
	ОткреплениеОтПрограммСтрахованияЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСтрокуОткрепления(Команда)
	
	ТекущиеДанные = Элементы.ОткреплениеСотрудников.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьОткреплениеСотрудников(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей(Команда)
	
	Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка = Не Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	ПоказыватьОтложенныхСтрахователей = Элементы.ОткреплениеСотрудниковПоказыватьОтложенныхСтрахователей.Пометка;
	УстановитьОтборСтрок(Элементы, "ОткреплениеСотрудников", "ОткреплениеОтПрограммыСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтложитьСотрудника(Сотрудник)
	
	НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Организация = Объект.Организация;
	НоваяЗапись.СтраховаяКомпания = Объект.СтраховаяКомпания;
	НоваяЗапись.Сотрудник = Сотрудник;
	НоваяЗапись.ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ФизическоеЛицо");
	
	НаборЗаписей.Записать();
	
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаСервере
Процедура ВозобновитьСотрудника(Сотрудник)
	
	НаборЗаписей = РегистрыСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Объект.Организация);
	НаборЗаписей.Отбор.СтраховаяКомпания.Установить(Объект.СтраховаяКомпания);
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	
	НаборЗаписей.Записать();
	
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОсновныхПолейНаСервере()
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеПрочитатьНастройки(ЭтотОбъект);
	
	ПрикреплениеКПрограммамСтрахованияЗаполнить();
	УстановитьОтборСтрок(Элементы, "ПрикреплениеСотрудников", "ПрикреплениеКПрограммеСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
	ОткреплениеОтПрограммСтрахованияЗаполнить();
	УстановитьОтборСтрок(Элементы, "ОткреплениеСотрудников", "ОткреплениеОтПрограммыСтрахованияОтложено", ПоказыватьОтложенныхСтрахователей);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "Организация", Объект.Организация,,, ЗначениеЗаполнено(Объект.Организация));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "Подразделение", Объект.Подразделение,,, ЗначениеЗаполнено(Объект.Подразделение));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(МедицинскоеСтрахование, "СтраховаяКомпания", Объект.СтраховаяКомпания,,, ЗначениеЗаполнено(Объект.СтраховаяКомпания));
	
КонецПроцедуры

&НаСервере
Процедура ПрикреплениеКПрограммамСтрахованияЗаполнить(Сотрудники = Неопределено)
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "ПрикреплениеСотрудников";
	
	МедицинскоеСтрахованиеФормы.ПрикреплениеКПрограммамСтрахованияЗаполнить(ЭтотОбъект, СтруктураИменТаблиц, Сотрудники, Ложь, Ложь);
	
	УстановитьТекстЗаголовкаПрикрепление();
	
КонецПроцедуры

&НаСервере
Процедура ОткреплениеОтПрограммСтрахованияЗаполнить()
	
	Объект.ОткреплениеСотрудников.Очистить();
	
	// Получим сведения по сотрудникам, не прикрепленных к программам страхования
	
	Если Не ЗначениеЗаполнено(Объект.Организация) ИЛИ Не ЗначениеЗаполнено(Объект.СтраховаяКомпания) Тогда
		// Показываем только сводные сведения
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", Объект.СтраховаяКомпания);
	Запрос.УстановитьПараметр("ДатаОкончанияСтрахования", Объект.ДатаОкончанияСтрахования);
	Запрос.УстановитьПараметр("ГруппаСотрудников", ГруппаСотрудников);
	Запрос.УстановитьПараметр("ОтборПоГруппеСотрудников", ЗначениеЗаполнено(ГруппаСотрудников));
	
	ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	ПараметрыПолученияСотрудников.Организация = Объект.Организация;
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПараметрыПолученияСотрудников.Подразделение = Объект.Подразделение;
	КонецЕсли;
	ПараметрыПолученияСотрудников.НачалоПериода 	= Объект.ДатаНачалаСтрахования;
	ПараметрыПолученияСотрудников.ОкончаниеПериода	= Объект.ДатаОкончанияСтрахования;
	ПараметрыПолученияСотрудников.КадровыеДанные	= "Организация, ДатаУвольнения";
	
	КадровыйУчет.СоздатьВТСотрудникиОрганизации(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник
	|ИЗ
	|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации";
	
	МассивСотрудников = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Если ОткреплятьСотрудниковВОтпускеПоУходуЗаРебенком Тогда
		
		Состояния = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Перечисления.СостоянияСотрудника.ОтпускПоУходуЗаРебенком);
		СостоянияСотрудников.СоздатьВТСостоянияСотрудников(
			Запрос.МенеджерВременныхТаблиц, МассивСотрудников, Состояния, Объект.ДатаНачалаСтрахования, Объект.ДатаОкончанияСтрахования);
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 0
		|	ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка) КАК Сотрудник,
		|	NULL КАК Начало
		|ПОМЕСТИТЬ ВТСостоянияСотрудников";
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ГруппаСотрудников) Тогда
		ГруппыСотрудников.СоздатьВТГруппыСотрудников(Запрос.МенеджерВременныхТаблиц, МассивСотрудников);
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	NULL КАК Сотрудник,
		|	NULL КАК ФизическоеЛицо,
		|	NULL КАК Группа
		|ПОМЕСТИТЬ ВТГруппыСотрудников";
		
		Запрос.Выполнить();
		
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МИНИМУМ(Сотрудники.ДатаОткрепления) КАК ДатаОткрепления
	|ПОМЕСТИТЬ ВТОткрепляемыеСотрудники
	|ИЗ
	|	(ВЫБРАТЬ
	|		СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|		СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|		СотрудникиОрганизации.ДатаУвольнения КАК ДатаОткрепления
	|	ИЗ
	|		ВТСотрудникиОрганизации КАК СотрудникиОрганизации
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
	|			ПО СотрудникиОрганизации.Сотрудник = ГруппыСотрудников.Сотрудник
	|	ГДЕ
	|		СотрудникиОрганизации.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|		И (НЕ &ОтборПоГруппеСотрудников
	|				ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СостоянияСотрудников.Сотрудник,
	|		СостоянияСотрудников.Сотрудник.ФизическоеЛицо,
	|		СостоянияСотрудников.Начало
	|	ИЗ
	|		ВТСостоянияСотрудников КАК СостоянияСотрудников
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТГруппыСотрудников КАК ГруппыСотрудников
	|			ПО СостоянияСотрудников.Сотрудник = ГруппыСотрудников.Сотрудник
	|	ГДЕ
	|		(НЕ &ОтборПоГруппеСотрудников
	|				ИЛИ ГруппыСотрудников.Группа = &ГруппаСотрудников)) КАК Сотрудники
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Сотрудник,
	|	Сотрудники.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиНеПрикрепленные.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТОтложенныеСотрудники
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиНеПрикрепленные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтложенноеМедицинскоеСтрахованиеСотрудников КАК ОтложенноеМедицинскоеСтрахованиеСотрудников
	|		ПО СотрудникиНеПрикрепленные.Сотрудник = ОтложенноеМедицинскоеСтрахованиеСотрудников.Сотрудник
	|			И (ОтложенноеМедицинскоеСтрахованиеСотрудников.Организация = &Организация)
	|			И (ОтложенноеМедицинскоеСтрахованиеСотрудников.СтраховаяКомпания = &СтраховаяКомпания)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация КАК Организация,
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(ПрограммыМедицинскогоСтрахованияСотрудников.Период) КАК Период
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыПрограммСтрахования
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
	|		ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|ГДЕ
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Период <= &ДатаОкончанияСтрахования
	|
	|СГРУППИРОВАТЬ ПО
	|	ПрограммыМедицинскогоСтрахованияСотрудников.Организация,
	|	СотрудникиОрганизации.Сотрудник,
	|	ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация КАК Организация,
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	|	МАКСИМУМ(РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период) КАК Период
	|ПОМЕСТИТЬ ВТМаксимальныеПериодыРасширенийСтрахования
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудников
	|		ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|ГДЕ
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период <= &ДатаОкончанияСтрахования
	|
	|СГРУППИРОВАТЬ ПО
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация,
	|	СотрудникиОрганизации.Сотрудник,
	|	РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиОрганизации.Сотрудник КАК Сотрудник,
	|	СотрудникиОрганизации.ДатаОткрепления КАК ДатаОткрепления,
	|	СотрудникиОрганизации.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтложенныеСотрудники.Сотрудник ЕСТЬ НЕ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтложенныйСотрудник
	|ИЗ
	|	ВТОткрепляемыеСотрудники КАК СотрудникиОрганизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныеПериодыПрограммСтрахования КАК МаксимальныеПериодыПрограммСтрахования
	|			ПО ПрограммыМедицинскогоСтрахованияСотрудников.Период = МаксимальныеПериодыПрограммСтрахования.Период
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = МаксимальныеПериодыПрограммСтрахования.ФизическоеЛицо
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.Организация = МаксимальныеПериодыПрограммСтрахования.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПрограммыМедицинскогоСтрахованияСотрудников КАК ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение
	|			ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо
	|				И ПрограммыМедицинскогоСтрахованияСотрудников.Период = ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.Период
	|				И (ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.Регистратор ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
	|		ПО (ПрограммыМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|			И СотрудникиОрганизации.ДатаОткрепления > ПрограммыМедицинскогоСтрахованияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаксимальныеПериодыРасширенийСтрахования КАК МаксимальныеПериодыРасширенийСтрахования
	|			ПО РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период = МаксимальныеПериодыРасширенийСтрахования.Период
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = МаксимальныеПериодыРасширенийСтрахования.ФизическоеЛицо
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = МаксимальныеПериодыРасширенийСтрахования.Организация
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасширенияПрограммМедицинскогоСтрахованияСотрудников КАК РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение
	|			ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период = РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.Период
	|				И (РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.Регистратор ССЫЛКА Документ.ОткреплениеОтПрограммМедицинскогоСтрахования)
	|		ПО (РасширенияПрограммМедицинскогоСтрахованияСотрудников.Организация = &Организация)
	|			И СотрудникиОрганизации.ФизическоеЛицо = РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо
	|			И СотрудникиОрганизации.ДатаОткрепления > РасширенияПрограммМедицинскогоСтрахованияСотрудников.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтложенныеСотрудники КАК ОтложенныеСотрудники
	|		ПО СотрудникиОрганизации.Сотрудник = ОтложенныеСотрудники.Сотрудник
	|ГДЕ
	|	(ПрограммыМедицинскогоСтрахованияСотрудников.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|				И ПрограммыМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо ЕСТЬ NULL
	|			ИЛИ РасширенияПрограммМедицинскогоСтрахованияСотрудников.ФизическоеЛицо ЕСТЬ НЕ NULL 
	|				И РасширенияПрограммМедицинскогоСтрахованияСотрудниковУвольнение.ФизическоеЛицо ЕСТЬ NULL)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникиОрганизации.Сотрудник";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Сотрудник") Цикл
		НоваяСтрока = Объект.ОткреплениеСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ДатаОткрепления = Выборка.ДатаОткрепления;
		НоваяСтрока.ОткреплениеОтПрограммыСтрахованияОтложено = Выборка.ОтложенныйСотрудник;
		НоваяСтрока.Команда = ?(Выборка.ОтложенныйСотрудник, НСтр("ru = 'Возобновить'"), НСтр("ru = 'Отложить'"));
	КонецЦикла;
	
	Объект.ОткреплениеСотрудников.Сортировать("Сотрудник");
	
	УстановитьТекстЗаголовкаОткрепление();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьНаКлиенте()
	
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.ДатаНачалаСтрахования) Или Не ЗначениеЗаполнено(Объект.ДатаОкончанияСтрахования) Тогда
		ТекстОшибки = НСтр("ru = 'Не указан период страхования.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(Элементы, ИмяТаблицы, ИмяСвойства, ПоказыватьОтложенныхСтрахователей)
	
	СтруктураОтбора = ?(ПоказыватьОтложенныхСтрахователей, Неопределено, Новый ФиксированнаяСтруктура(ИмяСвойства, Ложь));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, ИмяТаблицы, "ОтборСтрок", СтруктураОтбора);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗаголовкаПрикрепление()
	
	ТекстЗаголовка = НСтр("ru = 'Прикрепление к программам'");
	СтруктураОтбора = Новый Структура("ПрикреплениеКПрограммеСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ПрикреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	КоличествоСотрудников = НайденныеСтроки.Количество();
	Если КоличествоСотрудников > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + КоличествоСотрудников + ")";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаПрикреплениеКПрограммамСтрахования", "Заголовок", ТекстЗаголовка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстЗаголовкаОткрепление()
	
	ТекстЗаголовка = НСтр("ru = 'Открепление от программ'");
	СтруктураОтбора = Новый Структура("ОткреплениеОтПрограммыСтрахованияОтложено", Ложь);
	НайденныеСтроки = Объект.ОткреплениеСотрудников.НайтиСтроки(СтруктураОтбора);
	КоличествоСотрудников = НайденныеСтроки.Количество();
	Если КоличествоСотрудников > 0 Тогда
		ТекстЗаголовка = ТекстЗаголовка + " (" + КоличествоСотрудников + ")";
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОткрепление", "Заголовок", ТекстЗаголовка);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПоУмолчаниюЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Отмена Тогда
		ПриИзмененииОсновныхПолейНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикреплениеСотрудников(ДанныеСтроки = Неопределено, Сотрудники = Неопределено)
	
	// Если ссылка на документ существует, то просто открываем его.
	ПараметрыОткрытия = Новый Структура;
	Если ДанныеСтроки <> Неопределено И ЗначениеЗаполнено(ДанныеСтроки.ДокументПрикрепления) Тогда
		ПараметрыОткрытия.Вставить("Ключ", ДанныеСтроки.ДокументПрикрепления);
	Иначе
		// Если документ пока не был создан, пытаемся подобрать подходящий, 
		// если не удалось - создаем новый.
		ДокументПрикрепления = Неопределено;
		Если ДанныеСтроки <> Неопределено Тогда
			ДокументПрикрепления = ДокументПрикрепленияСотрудников(
				Объект.Организация, Объект.СтраховаяКомпания, ДанныеСтроки.Сотрудник, Объект.Подразделение);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("Ключ", ДокументПрикрепления);
		// На случай, если документ будет вновь созданным - передаем значения для заполнения.
		ЗначенияЗаполнения = Новый Структура;
		Если Не ЗначениеЗаполнено(ДокументПрикрепления) Тогда
			ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
			ЗначенияЗаполнения.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
			ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		Если Сотрудники = Неопределено Тогда
			Если ДанныеСтроки <> Неопределено Тогда
				ЗначенияЗаполнения.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки.Сотрудник));
			Иначе
				ЗначенияЗаполнения.Вставить("Сотрудники", Новый Массив);
			КонецЕсли;
		Иначе
			ЗначенияЗаполнения.Вставить("Сотрудники", Сотрудники);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ОткрытьФорму("Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументПрикрепленияСотрудников(Организация, СтраховаяКомпания, Сотрудник, Подразделение)
	
	// Подбираем не проведенный документ для сотрудника (по организации и страховой компании), 
	// исходя из следующего приоритета
	// 1) Документ, в котором уже есть этот сотрудник
	// 2) Документ, в котором нет этого сотрудника, но в котором совпадает подразделение (если подразделение заполнено)
	// 3) Документ, в котором нет этого сотрудника, без учета подразделения и количества сотрудников.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПрикреплениеКПрограммам.Ссылка КАК Ссылка,
	|	ПрикреплениеКПрограммам.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТПрикреплениеКПрограммам
	|ИЗ
	|	Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования КАК ПрикреплениеКПрограммам
	|ГДЕ
	|	ПрикреплениеКПрограммам.Организация = &Организация
	|	И ПрикреплениеКПрограммам.СтраховаяКомпания = &СтраховаяКомпания
	|	И ПрикреплениеКПрограммам.ПометкаУдаления = ЛОЖЬ
	|	И ПрикреплениеКПрограммам.Проведен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПрикреплениеКПрограммам.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Документ.ПрикреплениеКПрограммамМедицинскогоСтрахования.Сотрудники КАК СотрудникиДокумента
	|				ГДЕ
	|					СотрудникиДокумента.Ссылка = ПрикреплениеКПрограммам.Ссылка
	|					И СотрудникиДокумента.Сотрудник = &Сотрудник)
	|			ТОГДА 1
	|		КОГДА &ПодразделениеЗаполнено
	|			ТОГДА ВЫБОР
	|					КОГДА ПрикреплениеКПрограммам.Подразделение = &Подразделение
	|						ТОГДА 2
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТПрикреплениеКПрограммамПриоритеты
	|ИЗ
	|	ВТПрикреплениеКПрограммам КАК ПрикреплениеКПрограммам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ПрикреплениеКПрограммамПриоритеты.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТМинимальныйПриоритет
	|ИЗ
	|	ВТПрикреплениеКПрограммамПриоритеты КАК ПрикреплениеКПрограммамПриоритеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПрикреплениеКПрограммамПриоритеты.Ссылка) КАК Ссылка
	|ИЗ
	|	ВТПрикреплениеКПрограммамПриоритеты КАК ПрикреплениеКПрограммамПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМинимальныйПриоритет КАК МинимальныйПриоритет
	|		ПО (МинимальныйПриоритет.Приоритет = ПрикреплениеКПрограммамПриоритеты.Приоритет)
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ПрикреплениеКПрограммамПриоритеты.Ссылка) ЕСТЬ НЕ NULL ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеЗаполнено", ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОткреплениеСотрудников(ДанныеСтроки = Неопределено, Сотрудники = Неопределено)
	
	// Если ссылка на документ существует, то просто открываем его.
	ПараметрыОткрытия = Новый Структура;
	Если ДанныеСтроки <> Неопределено И ЗначениеЗаполнено(ДанныеСтроки.ДокументОткрепления) Тогда
		ПараметрыОткрытия.Вставить("Ключ", ДанныеСтроки.ДокументОткрепления);
	Иначе
		// Если документ пока не был создан, пытаемся подобрать подходящий, 
		// если не удалось - создаем новый.
		ДокументПрикрепления = Неопределено;
		Если ДанныеСтроки <> Неопределено Тогда
			ДокументОткрепления = ДокументОткрепленияСотрудников(
				Объект.Организация, Объект.СтраховаяКомпания, ДанныеСтроки.Сотрудник, Объект.Подразделение);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("Ключ", ДокументОткрепления);
		// На случай, если документ будет вновь созданным - передаем значения для заполнения.
		ЗначенияЗаполнения = Новый Структура;
		Если Не ЗначениеЗаполнено(ДокументОткрепления) Тогда
			ЗначенияЗаполнения.Вставить("Организация", Объект.Организация);
			ЗначенияЗаполнения.Вставить("СтраховаяКомпания", Объект.СтраховаяКомпания);
			ЗначенияЗаполнения.Вставить("Подразделение", Объект.Подразделение);
		КонецЕсли;
		Если Сотрудники = Неопределено Тогда
			Если ДанныеСтроки <> Неопределено Тогда
				ЗначенияЗаполнения.Вставить("Сотрудники", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки.Сотрудник));
			Иначе
				ЗначенияЗаполнения.Вставить("Сотрудники", Новый Массив);
			КонецЕсли;
		Иначе
			ЗначенияЗаполнения.Вставить("Сотрудники", Сотрудники);
		КонецЕсли;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	ОткрытьФорму("Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументОткрепленияСотрудников(Организация, СтраховаяКомпания, Сотрудник, Подразделение)
	
	// Подбираем не проведенный документ для сотрудника (по организации и страховой компании), 
	// исходя из следующего приоритета
	// 1) Документ, в котором уже есть этот сотрудник
	// 2) Документ, в котором нет этого сотрудника, но в котором совпадает подразделение (если подразделение заполнено)
	// 3) Документ, в котором нет этого сотрудника, без учета подразделения и количества сотрудников.
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ОткреплениеОтПрограмм.Ссылка КАК Ссылка,
	|	ОткреплениеОтПрограмм.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТОткреплениеОтПрограмм
	|ИЗ
	|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ОткреплениеОтПрограмм
	|ГДЕ
	|	ОткреплениеОтПрограмм.Организация = &Организация
	|	И ОткреплениеОтПрограмм.СтраховаяКомпания = &СтраховаяКомпания
	|	И ОткреплениеОтПрограмм.ПометкаУдаления = ЛОЖЬ
	|	И ОткреплениеОтПрограмм.Проведен = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОткреплениеОтПрограмм.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ИСТИНА В
	|				(ВЫБРАТЬ ПЕРВЫЕ 1
	|					ИСТИНА
	|				ИЗ
	|					Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК СотрудникиДокумента
	|				ГДЕ
	|					СотрудникиДокумента.Ссылка = ОткреплениеОтПрограмм.Ссылка
	|					И СотрудникиДокумента.Сотрудник = &Сотрудник)
	|			ТОГДА 1
	|		КОГДА &ПодразделениеЗаполнено
	|			ТОГДА ВЫБОР
	|					КОГДА ОткреплениеОтПрограмм.Подразделение = &Подразделение
	|						ТОГДА 2
	|					ИНАЧЕ 3
	|				КОНЕЦ
	|		ИНАЧЕ 4
	|	КОНЕЦ КАК Приоритет
	|ПОМЕСТИТЬ ВТОткреплениеОтПрограммПриоритеты
	|ИЗ
	|	ВТОткреплениеОтПрограмм КАК ОткреплениеОтПрограмм
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ОткреплениеОтПрограммПриоритеты.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТМинимальныйПриоритет
	|ИЗ
	|	ВТОткреплениеОтПрограммПриоритеты КАК ОткреплениеОтПрограммПриоритеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ОткреплениеОтПрограммПриоритеты.Ссылка) КАК Ссылка
	|ИЗ
	|	ВТОткреплениеОтПрограммПриоритеты КАК ОткреплениеОтПрограммПриоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМинимальныйПриоритет КАК МинимальныйПриоритет
	|		ПО (МинимальныйПриоритет.Приоритет = ОткреплениеОтПрограммПриоритеты.Приоритет)
	|
	|ИМЕЮЩИЕ
	|	МАКСИМУМ(ОткреплениеОтПрограммПриоритеты.Ссылка) ЕСТЬ НЕ NULL ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховаяКомпания);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("ПодразделениеЗаполнено", ЗначениеЗаполнено(Подразделение));
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура УсловияСтрахованияСотрудниковЗакрытие(Результат, ДополнительныеПараметры) Экспорт
	
	ГруппаСотрудников = Результат;
	ПриИзмененииОсновныхПолейНаСервере();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьЭлементов(Элементы, УсловияСтрахованияСотрудников)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСотрудников", "Доступность", УсловияСтрахованияСотрудников <> 0);
КонецПроцедуры

#КонецОбласти
